# Orders No normalization
This table is **not normalized**. It contains repeating groups and redundant data.

### Problems:
- `ProductList` stores multiple items in a single column (comma-separated)
- Customer name and address repeat in every order
- Update anomalies: changing a customer's address requires updating multiple rows
- Insertion/deletion anomalies possible

We will load 50 rows here (using Indian names and products).

In [ ]:
CREATE TABLE Orders_Unnormalized (
    OrderID NUMBER,
    CustomerName VARCHAR2(50),
    Address VARCHAR2(100),
    ProductList VARCHAR2(200),
    TotalAmount NUMBER
);

In [ ]:
INSERT ALL
  INTO Orders_Unnormalized VALUES (1, 'Arjun Sharma', 'Bengaluru', 'Laptop, Mouse', 1000)
  INTO Orders_Unnormalized VALUES (2, 'Priya Nair', 'Chennai', 'Rice, Oil, Sugar', 1050)
  INTO Orders_Unnormalized VALUES (3, 'Ramesh Iyer', 'Hyderabad', 'Mobile, Charger', 1100)
  INTO Orders_Unnormalized VALUES (4, 'Kavita Desai', 'Mumbai', 'Mixer, Grinder', 1150)
  INTO Orders_Unnormalized VALUES (5, 'Meena Joshi', 'Pune', 'TV, Remote', 1200)
  INTO Orders_Unnormalized VALUES (6, 'Suresh Reddy', 'Delhi', 'Chair, Table', 1250)
  INTO Orders_Unnormalized VALUES (7, 'Ananya Rao', 'Kolkata', 'Pen, Notebook, Bag', 1300)
  INTO Orders_Unnormalized VALUES (8, 'Rajesh Gupta', 'Jaipur', 'Shoes, Socks', 1350)
  INTO Orders_Unnormalized VALUES (9, 'Neha Kulkarni', 'Ahmedabad', 'Watch, Earphones', 1400)
  INTO Orders_Unnormalized VALUES (10, 'Manoj Verma', 'Lucknow', 'Fan, Cooler', 1450)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders_Unnormalized VALUES (11, 'Arjun Sharma', 'Bengaluru', 'Laptop, Mouse', 1500)
  INTO Orders_Unnormalized VALUES (12, 'Priya Nair', 'Chennai', 'Rice, Oil, Sugar', 1550)
  INTO Orders_Unnormalized VALUES (13, 'Ramesh Iyer', 'Hyderabad', 'Mobile, Charger', 1600)
  INTO Orders_Unnormalized VALUES (14, 'Kavita Desai', 'Mumbai', 'Mixer, Grinder', 1650)
  INTO Orders_Unnormalized VALUES (15, 'Meena Joshi', 'Pune', 'TV, Remote', 1700)
  INTO Orders_Unnormalized VALUES (16, 'Suresh Reddy', 'Delhi', 'Chair, Table', 1750)
  INTO Orders_Unnormalized VALUES (17, 'Ananya Rao', 'Kolkata', 'Pen, Notebook, Bag', 1800)
  INTO Orders_Unnormalized VALUES (18, 'Rajesh Gupta', 'Jaipur', 'Shoes, Socks', 1850)
  INTO Orders_Unnormalized VALUES (19, 'Neha Kulkarni', 'Ahmedabad', 'Watch, Earphones', 1900)
  INTO Orders_Unnormalized VALUES (20, 'Manoj Verma', 'Lucknow', 'Fan, Cooler', 1950)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders_Unnormalized VALUES (21, 'Arjun Sharma', 'Bengaluru', 'Laptop, Mouse', 2000)
  INTO Orders_Unnormalized VALUES (22, 'Priya Nair', 'Chennai', 'Rice, Oil, Sugar', 2050)
  INTO Orders_Unnormalized VALUES (23, 'Ramesh Iyer', 'Hyderabad', 'Mobile, Charger', 2100)
  INTO Orders_Unnormalized VALUES (24, 'Kavita Desai', 'Mumbai', 'Mixer, Grinder', 2150)
  INTO Orders_Unnormalized VALUES (25, 'Meena Joshi', 'Pune', 'TV, Remote', 2200)
  INTO Orders_Unnormalized VALUES (26, 'Suresh Reddy', 'Delhi', 'Chair, Table', 2250)
  INTO Orders_Unnormalized VALUES (27, 'Ananya Rao', 'Kolkata', 'Pen, Notebook, Bag', 2300)
  INTO Orders_Unnormalized VALUES (28, 'Rajesh Gupta', 'Jaipur', 'Shoes, Socks', 2350)
  INTO Orders_Unnormalized VALUES (29, 'Neha Kulkarni', 'Ahmedabad', 'Watch, Earphones', 2400)
  INTO Orders_Unnormalized VALUES (30, 'Manoj Verma', 'Lucknow', 'Fan, Cooler', 2450)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders_Unnormalized VALUES (31, 'Arjun Sharma', 'Bengaluru', 'Laptop, Mouse', 2500)
  INTO Orders_Unnormalized VALUES (32, 'Priya Nair', 'Chennai', 'Rice, Oil, Sugar', 2550)
  INTO Orders_Unnormalized VALUES (33, 'Ramesh Iyer', 'Hyderabad', 'Mobile, Charger', 2600)
  INTO Orders_Unnormalized VALUES (34, 'Kavita Desai', 'Mumbai', 'Mixer, Grinder', 2650)
  INTO Orders_Unnormalized VALUES (35, 'Meena Joshi', 'Pune', 'TV, Remote', 2700)
  INTO Orders_Unnormalized VALUES (36, 'Suresh Reddy', 'Delhi', 'Chair, Table', 2750)
  INTO Orders_Unnormalized VALUES (37, 'Ananya Rao', 'Kolkata', 'Pen, Notebook, Bag', 2800)
  INTO Orders_Unnormalized VALUES (38, 'Rajesh Gupta', 'Jaipur', 'Shoes, Socks', 2850)
  INTO Orders_Unnormalized VALUES (39, 'Neha Kulkarni', 'Ahmedabad', 'Watch, Earphones', 2900)
  INTO Orders_Unnormalized VALUES (40, 'Manoj Verma', 'Lucknow', 'Fan, Cooler', 2950)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders_Unnormalized VALUES (41, 'Arjun Sharma', 'Bengaluru', 'Laptop, Mouse', 3000)
  INTO Orders_Unnormalized VALUES (42, 'Priya Nair', 'Chennai', 'Rice, Oil, Sugar', 3050)
  INTO Orders_Unnormalized VALUES (43, 'Ramesh Iyer', 'Hyderabad', 'Mobile, Charger', 3100)
  INTO Orders_Unnormalized VALUES (44, 'Kavita Desai', 'Mumbai', 'Mixer, Grinder', 3150)
  INTO Orders_Unnormalized VALUES (45, 'Meena Joshi', 'Pune', 'TV, Remote', 3200)
  INTO Orders_Unnormalized VALUES (46, 'Suresh Reddy', 'Delhi', 'Chair, Table', 3250)
  INTO Orders_Unnormalized VALUES (47, 'Ananya Rao', 'Kolkata', 'Pen, Notebook, Bag', 3300)
  INTO Orders_Unnormalized VALUES (48, 'Rajesh Gupta', 'Jaipur', 'Shoes, Socks', 3350)
  INTO Orders_Unnormalized VALUES (49, 'Neha Kulkarni', 'Ahmedabad', 'Watch, Earphones', 3400)
  INTO Orders_Unnormalized VALUES (50, 'Manoj Verma', 'Lucknow', 'Fan, Cooler', 3450)
SELECT * FROM dual;

In [ ]:
SELECT * FROM Orders_Unnormalized;

### Summary
- This unnormalized table violates 1NF because `ProductList` has repeating groups.
- Redundancy: Customer data is repeated across many rows.
- Update anomaly: Changing address for 'Arjun Sharma' requires editing multiple rows.
- Deletion anomaly: If the only order containing 'Mobile' is deleted, product info is lost.
- Insertion anomaly: Cannot add a new product without tying it to an order.